chore: 优化 readme 架构图
